config/tests/reviews_post_stress_test.yml
config:
  target: 'http://localhost:3000'
  http:
    timeout: 10 # Responses have to be sent within 10 seconds or the request will be aborted

  phases:
    # Create 100 virtual users every second for 60 seconds
    - duration: 60 # seconds
      arrivalRate: 100 # virtual users

scenarios:
  - name: 'Load test post reviews request'
    flow:
      - post:
          url: '/reviews'
          expect:
            - statusCode: 200